#!/usr/local/bin/python
(原始碼:=(ソースコード:=open(__file__).read()),print("Hint: Type `原始碼` or `ソースコード` to get the source code.\rWelcome to Cat Translator, you can only type 喵 or ニャーン here!\n"),喵:="Meow!",ニャーン:="Nyan!",[not(__import__('re').search("[a-zA-Z0-9 ]+",code:=input("> ").strip()))and(print(eval(code)))for(this_is_Chu_Shi_Biao_aka_出師表__which_has_nothing_to_do_with_this_challenge_lol)in(iter(int,"""

　　=====前出師表=====

　　臣亮言：先帝創業未半而中道崩殂，今天下三分，益州疲敝，此誠危急存亡之秋也。然侍衞之臣不懈於內，忠志之士忘身於外者，蓋追先帝之殊遇，欲報之於陛下也。

　　誠宜開張聖聽，以光先帝遺德，恢弘志士之氣，不宜妄自菲薄，引喻失義，以塞忠諫之路也。

　　宮中府中，俱爲一體，陟罰臧否，不宜異同。若有作奸犯科及爲忠善者，宜付有司論其刑賞，以昭陛下平明之治，不宜偏私，使內外異法也。

　　侍中、侍郎郭攸之、費禕、董允等，此皆良實，志慮忠純，是以先帝簡拔以遺陛下。愚以爲宮中之事，事無大小，悉以咨之，然後施行，必能裨補闕漏，有所廣益。

　　將軍向寵，性行淑均，曉暢軍事，試用之於昔日，先帝稱之曰能，是以衆議舉寵爲督。愚以爲營中之事，悉以咨之，必能使行陣和睦，優劣得所也。

　　親賢臣，遠小人，此先漢所以興隆也；親小人，遠賢臣，此後漢所以傾頹也。先帝在時，每與臣論此事，未嘗不歎息痛恨於桓、靈也。侍中、尚書、長史、參軍，此悉貞亮死節之臣也，願陛下親之信之，則漢室之隆，可計日而待也。

　　臣本布衣，躬耕於南陽，苟全性命於亂世，不求聞達於諸侯。先帝不以臣卑鄙，猥自枉屈，三顧臣於草廬之中，諮臣以當世之事，由是感激，遂許先帝以驅馳。後值傾覆，受任於敗軍之際，奉命於危難之間，爾來二十有一年矣。先帝知臣謹慎，故臨崩寄臣以大事也。受命以來，夙夜憂歎，恐託付不效，以傷先帝之明，故五月渡瀘，深入不毛。今南方已定，兵甲已足，當獎率三軍，北定中原，庶竭駑鈍，攘除姦凶，興復漢室，還於舊都，此臣所以報先帝，而忠陛下之職分也。至於斟酌損益，進盡忠言，則攸之、禕、允之任也。

　　願陛下託臣以討賊興復之效；不效，則治臣之罪，以告先帝之靈。若無興德之言，則責攸之、禕、允等之慢，以彰其咎。陛下亦宜自謀，以諮諏善道，察納雅言。深追先帝遺詔，臣不勝受恩感激。

　　今當遠離，臨表涕泣，不知所云。 


　　=====後出師表=====

　　先帝慮漢賊不兩立，王業不偏安，故託臣以討賊也。以先帝之明，量臣之才，故知臣伐賊才弱敵强也。然不伐賊，王業亦亡，惟坐待亡，孰與伐之？是故託臣而弗疑也。

　　臣受命之日，寢不安席，食不甘味，思惟北征，宜先入南，故五月渡瀘，深入不毛，幷日而食。臣非不自惜也，顧王業不得偏安於蜀都，故冒危難以奉先帝之遺意也，而議者謂爲非計。今賊適疲於西，又務於東，兵法乘勞，此進趨之時也。

　　謹陳其事如左：高帝明並日月，謀臣淵深，然涉險被創，危然後安。今陛下未及高帝，謀臣不如良、平，而欲以長計取勝，坐定天下，此臣之未解一也。劉繇、王朗各據州郡，論安言計，動引聖人，羣疑滿腹，衆難塞胸，今歲不戰，明年不征，使孫策坐大，遂幷江東，此臣之未解二也。曹操智計殊絕於人，其用兵也，髣髴孫、吳，然困於南陽，險於烏巢，危於祁連，偪於黎陽，幾敗北山，殆死潼關，然後僞定一時耳，況臣才弱，而欲以不危而定之，此臣之未解三也。曹操五攻昌霸不下，四越巢湖不成，任用李服而李服圖之，委夏侯而夏侯敗亡，先帝每稱操爲能，猶有此失，況臣駑下，何能必勝？此臣之未解四也。自臣到漢中，中間朞年耳，然喪趙雲、陽羣、馬玉、閻芝、丁立、白壽、劉郃、鄧銅等及曲長屯將七十餘人，突將無前，賨、叟、青羌散騎、武騎一千餘人，此皆數十年之內所糾合四方之精銳，非一州之所有，若復數年，則損三分之二也，當何以圖敵？此臣之未解五也。今民窮兵疲，而事不可息，事不可息，則住與行勞費正等，而不及今圖之，欲以一州之地與賊持久，此臣之未解六也。

　　夫難平者，事也。昔先帝敗軍於楚，當此時，曹操拊手，謂天下以定。然後先帝東連吳越，西取巴蜀，舉兵北征，夏侯授首，此操之失計而漢事將成也。然後吳更違盟，關羽毀敗，秭歸蹉跌，曹丕稱帝。凡事如是，難可逆見。臣鞠躬盡瘁，死而後已，至於成敗利鈍，非臣之明所能逆覩也。 

"""))])
